ox_docs/mathematics/linear_algebra/KBe21math530retMatrixTransposePonderQuestions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-26 Sun 09:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Questions to Ponder about \(A^TA\) and \(AA^T\)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Questions to Ponder about \(A^TA\) and \(AA^T\)</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-11 Sat 16:34</date></div>
</div>
<div id="content">
<h1 class="title">Questions to Ponder about \(A^TA\) and \(AA^T\)</h1>
<div id="outline-container-org14bbb6e" class="outline-2">
<h2 id="org14bbb6e"><span class="section-number-2">1</span> A real valued matrix</h2>
<div class="outline-text-2" id="text-1">
<p>
Let \(A =\begin{pmatrix}2 &1 \\ 3 & 2\end{pmatrix}\)
\[\begin{aligned}
  AA^T &= \begin{pmatrix}2 &1 \\ 3 & 2\end{pmatrix}\begin{pmatrix}2 &3 \\ 1 & 2\end{pmatrix} &=\begin{pmatrix}5 & 8 \\ 8 & 13\end{pmatrix}\\
  A^TA &= \begin{pmatrix}2 &3 \\ 1 & 2\end{pmatrix}\begin{pmatrix}2 &1 \\ 3 & 2\end{pmatrix} &=\begin{pmatrix}13 & 8 \\ 8 & 5\end{pmatrix}\\
  \end{aligned}\]
</p>

<p>
\[\begin{aligned}
</p>
\begin{pmatrix}a&b\\c&d\end{pmatrix}\begin{pmatrix}a&c\\b&d\end{pmatrix} =\begin{pmatrix}a^2+b^2 & ac+bd \\ ac+bd & c^2+d^2 \end{pmatrix}
<p>
\end{aligned}\]
Then, \(A^TA\) is the same thing, but with \(b, c\) swapped.
</p>
</div>
</div>
<div id="outline-container-orga723aa3" class="outline-2">
<h2 id="orga723aa3"><span class="section-number-2">2</span> For complex matrices</h2>
<div class="outline-text-2" id="text-2">
<p>
\[\begin{aligned}
</p>
\begin{pmatrix}a+bi & c+di \\ f+gi & j+ki\end{pmatrix} \begin{pmatrix}a+bi & f+gi \\ c+di & j+ki\end{pmatrix} =
\begin{pmatrix}a^2-b^2+2abi + c^2-d^2+2cdi & af + agi + bfi - bg \\ af + agi + bfi - bg & f^2-g^2+2fgi + j^2-k^2+2jki\end{pmatrix}
<p>
\end{aligned}\]
</p>

<p>
I'm not sure if I'm noticing anything different from the real ones, although maybe the variables are just too confusing.
</p>
</div>
</div>
<div id="outline-container-org86b8da9" class="outline-2">
<h2 id="org86b8da9"><span class="section-number-2">3</span> Complex conjugate (\(A^*A\) vs \(A A^*\))</h2>
<div class="outline-text-2" id="text-3">
<p>
\[\begin{aligned}
</p>
\begin{pmatrix}a+bi & c+di \\ f+gi & j+ki \end{pmatrix}
\begin{pmatrix}a-bi & f-gi \\ c-di & j-ki \end{pmatrix} =
\begin{pmatrix} a^2 + b^2 + c^2 + d^2 & () \\ () & f^2 + g^2 + j^2 + k^2 \end{pmatrix}
<p>
\end{aligned}\]
</p>

<p>
\[\begin{aligned}
</p>
\begin{pmatrix}a-bi & f-gi \\ c-di & j-ki \end{pmatrix}
\begin{pmatrix}a+bi & c+di \\ f+gi & j+ki \end{pmatrix} =
\begin{pmatrix} a^2 + b^2 + f^2 + g^2 & () \\ () & c^2 + d^2 + j^2 + k^2 \end{pmatrix}
<p>
\end{aligned}\]
</p>

<p>
The diagonals are real-valued, and the matrices are symmetric about the diagonal. I wonder if this means the matrices have identical eigenvalues&#x2026; how do the diagonals of complex matricies change when they are upper-triangularized?
</p>
</div>
</div>
<div id="outline-container-org5943467" class="outline-2">
<h2 id="org5943467"><span class="section-number-2">4</span> Transpose distributivity with matrix multiplication</h2>
<div class="outline-text-2" id="text-4">
<p>
\[\begin{aligned}
  (AB)^\top =\left(\begin{pmatrix}a&b\\c&d\end{pmatrix}\begin{pmatrix}w&x\\y&z\end{pmatrix}\right) ^\top
  =\begin{pmatrix}aw+by & cw+dy \\ ax + bz & cx + dz \end{pmatrix} =\begin{pmatrix}w&y\\x&z\end{pmatrix}\begin{pmatrix}a&c\\b&d\end{pmatrix} = B^\top A^\top
  \end{aligned}\]
</p>

<p>
I have no good proof of this for larger matrices or non-square matrices, but it makes sense because both scalar addition and scalar multiplication are commutative and transposing swaps rows for columns. Thus, when a matrix on the left is multiplied by a matrix on the right, it is the same as the left matrix becoming the right matrix but after a transpose, because both operations swap the rows and columns in some sense so they "cancel out".
</p>
</div>
</div>
<div id="outline-container-orgd64829b" class="outline-2">
<h2 id="orgd64829b"><span class="section-number-2">5</span> Determinant distributivity with matrix multiplication</h2>
<div class="outline-text-2" id="text-5">
<p>
\[\begin{aligned}
  &\left| \begin{pmatrix}aw+by & ax + bz\\ cw + dy & cx + dz\end{pmatrix} \right|   \\
  &= (aw+by)(cx+dz) - (ax+bz)(cw+dy) \\
  &= \cancel{acwx} + adwz + bcxy + \cancel{bdyz} - (\cancel{acwx} + adxy + bcwz + \cancel{bdyz}) \\
  &= adwz - adxy - bcwz + bcxy\\
  &= (ad-bc)(wz-xy) \\
  &= \left|\begin{pmatrix}a&b\\c&d\end{pmatrix}\right|\left|\begin{pmatrix}w&x\\y&z\end{pmatrix}\right|
  \end{aligned}\]
</p>

<p>
This makes sense given that the determinant of a matrix can be considered a "scaling factor." We had talked about the determinant being the area of the parallelogram of the column vectors, but not about how that represented the matrix multiplied by the identity whose column parallelogram has area one. Thus, the composition should multiply areas, which it seems to do.
</p>

<p>
This can probably be the base case of an induction proof that extends this to larger matrices, since determinants are defined recursively.
</p>
</div>
</div>
</div>
</body>
</html>
